 DEFINE PROGRAM(COLIQ01) GROUP(CARDDEMO)
 DESCRIPTION(INTRADAY LIQUIDITY INQUIRY)
        RELOAD(NO) RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO)
        STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY) EXECKEY(USER)
        CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO) TRANSID(CDRL)
        EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(23/03/23 15:10:46)
        CHANGETIME(23/03/23 15:10:46) CHANGEUSRID(GILBION)
        CHANGEAGENT(CSDBATCH) CHANGEAGREL(0730)
 DEFINE TRANSACTION(CDRL) GROUP(CARDDEMO)
        PROGRAM(COLIQ01) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
        DEFINETIME(23/03/23 15:10:46) CHANGETIME(23/03/23 15:10:46)
        CHANGEUSRID(GILBION) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0730)
 DEFINE MQQUEUE(CARDLIQR) GROUP(CARDDEMO)
        DESCRIPTION(LIQUIDITY INQUIRY REQUEST QUEUE)
        QNAME(CARDDEMO.LIQUIDITY.REQUEST.QUEUE)
        DEFINETIME(23/03/23 15:10:46) CHANGETIME(23/03/23 15:10:46)
        CHANGEUSRID(GILBION) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0730)
 DEFINE MQQUEUE(CARDLIQS) GROUP(CARDDEMO)
        DESCRIPTION(LIQUIDITY INQUIRY RESPONSE QUEUE)
        QNAME(CARD.DEMO.REPLY.LIQ)
        DEFINETIME(23/03/23 15:10:46) CHANGETIME(23/03/23 15:10:46)
        CHANGEUSRID(GILBION) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0730)
